{
  "slug": "baked-thick-cut-bacon-with-rhubarb-chutney",
  "title": "Baked Thick-Cut Bacon with Rhubarb Chutney",
  "description": "Delicious baked thick-cut bacon with rhubarb chutney recipe",
  "ingredients": [
    {
      "amount": "⅓",
      "unit": "cup",
      "name": "sugar"
    },
    {
      "amount": "¼",
      "unit": "cup",
      "name": "light corn syrup"
    },
    {
      "amount": "3",
      "unit": "tablespoons",
      "name": "white-wine vinegar"
    },
    {
      "amount": "8",
      "unit": "ounces",
      "name": "rhubarb, cut into a ½-inch dice (2 cups)"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 shallot, finely chopped (⅓ cup)"
    },
    {
      "amount": "1",
      "unit": "tablespoon",
      "name": "finely chopped fresh ginger (from a 1 ½-inch piece)"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "½ habanero or Scotch-bonnet pepper, finely chopped (ribs and seeds removed for less heat, if desired)"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Kosher salt and freshly ground pepper"
    },
    {
      "amount": "1 ¼",
      "unit": "pounds",
      "name": "extra-thick-cut bacon, halved crosswise"
    }
  ],
  "instructions": [
    "Preheat oven to 375°F. Combine sugar, corn syrup, and 1/4 cup water in a medium saucepan. Cover and cook over medium heat until sugar has dissolved, about 5 minutes. Uncover, increase heat to medium-high, and boil until caramel turns medium amber, 3 to 4 minutes. Carefully add vinegar (mixture will spatter and caramel will seize). Continue cooking, stirring, until caramel dissolves again.",
    "Stir in rhubarb, shallot, ginger, chile pepper, and 1/4 teaspoon each salt and pepper; return to a boil. Reduce heat to medium-low, cover, and simmer until rhubarb is tender and liquid is syrupy, about 10 minutes. Strain chutney, reserving syrup, and transfer to a serving bowl. Return syrup to saucepan and simmer over medium heat until thickened and reduced to 1/3 cup, about 5 minutes. Arrange bacon in a single layer on a wire rack set inside a rimmed baking sheet.",
    "Bake bacon in oven 15 minutes. Brush tops of bacon with half of rhubarb syrup. Bake 5 minutes more, then flip bacon and brush other sides with remaining syrup. Continue baking until glossy and most of fat has rendered but bacon is still pliable (it should not crisp), 12 to 15 minutes more. Serve warm, with chutney."
  ],
  "tags": [
    "dessert",
    "baked",
    "rhubarb"
  ],
  "yield": "8",
  "image": "/images/recipes/baked-thick-cut-bacon-with-rhubarb-chutney.jpg",
  "prepTime": "25 mins",
  "cookTime": "1 hr"
}