{
  "slug": "best-creamy-slow-cooker-broccoli-cheddar-soup",
  "title": "Best Creamy Slow Cooker Broccoli Cheddar Soup",
  "description": "Delicious best creamy slow cooker broccoli cheddar soup recipe",
  "ingredients": [
    {
      "amount": "3",
      "unit": "tablespoons",
      "name": "whole wheat flour or white whole wheat"
    },
    {
      "amount": "1",
      "unit": "cup",
      "name": "low-fat milk organic preferred"
    },
    {
      "amount": "3",
      "unit": "tablespoons",
      "name": "olive oil"
    },
    {
      "amount": "4",
      "unit": "cups",
      "name": "chicken broth or vegetable broth, low sodium preferred"
    },
    {
      "amount": "1",
      "unit": "pound",
      "name": "broccoli frozen, thawed and chopped"
    },
    {
      "amount": "3 cups cheddar cheese shredded, skim not recommended for this recipe, please buy the",
      "unit": "block",
      "name": "and shred yourself to avoid waxes"
    },
    {
      "amount": "1 garlic",
      "unit": "clove",
      "name": "minced"
    }
  ],
  "instructions": [
    "In a frying pan, heat your oil, but don't let it get so hot it smokes. Using a whisk, whisk in the flour a little at a time so that the flour and oil mix well and start to bubble, and become golden in color and fragrant.",
    "Slowly pour in the milk in a steady slow stream, whisking the whole time until a cream is formed. Follow with the chicken or vegetable broth until fully incorporated and then remove from heat.",
    "Pour the mixture into your slow cooker and add the thawed broccoli. We use the frozen broccoli because it seems to hold up better in a slow cooker than the fresh variety. But you can certainly use fresh broccoli florets as well. Add salt to taste, black pepper and garlic, stir to combine.",
    "Cook on low for 4-6 hours, or until the broccoli is completely cooked. Stir in the cheese, 1 cup at a time, allowing it to melt completely before adding the next cup of cheese.",
    "Puree the soup in the blender in batches, filling halfway each time. A hand blender (immersion blender) will also work. Be sure to scrape any of the remaining cheese from the bottom of the slow cooker into the soup to blend well. Blend as little or as much as you like until desired consistency is achieved, i.e. some prefer a smoother and some prefer a chunkier soup ."
  ],
  "tags": [
    "chicken",
    "soup",
    "slow-cooker"
  ],
  "yield": "Serving size 1 cup",
  "image": "/images/recipes/best-creamy-slow-cooker-broccoli-cheddar-soup.jpg",
  "prepTime": "10 minutes",
  "cookTime": "6 hours"
}