{
  "slug": "best-strawberry-rhubarb-pie",
  "title": "Best Strawberry-Rhubarb Pie",
  "description": "Delicious best strawberry-rhubarb pie recipe",
  "ingredients": [
    {
      "amount": 1,
      "unit": "large",
      "name": "egg",
      "_originalAmount": "1"
    },
    {
      "amount": 4,
      "unit": "tablespoons",
      "name": "ice water, divided",
      "_originalAmount": "4 to 5"
    },
    {
      "amount": 0.75,
      "unit": "teaspoon",
      "name": "white vinegar",
      "_originalAmount": "3/4"
    },
    {
      "amount": 2,
      "unit": "cups",
      "name": "all-purpose flour",
      "_originalAmount": "2-1/4"
    },
    {
      "amount": 0.75,
      "unit": "teaspoon",
      "name": "salt",
      "_originalAmount": "3/4"
    },
    {
      "amount": 0.75,
      "unit": "cup",
      "name": "cold lard",
      "_originalAmount": "3/4"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "filling:"
    },
    {
      "amount": 1,
      "unit": "cups",
      "name": "sugar",
      "_originalAmount": "1-1/4"
    },
    {
      "amount": 6,
      "unit": "tablespoons",
      "name": "quick-cooking tapioca",
      "_originalAmount": "6"
    },
    {
      "amount": 3,
      "unit": "cups",
      "name": "sliced fresh or frozen rhubarb, thawed",
      "_originalAmount": "3"
    },
    {
      "amount": 3,
      "unit": "cups",
      "name": "halved fresh strawberries",
      "_originalAmount": "3"
    },
    {
      "amount": 3,
      "unit": "tablespoons",
      "name": "butter",
      "_originalAmount": "3"
    },
    {
      "amount": 1,
      "unit": "tablespoon",
      "name": "2% milk",
      "_originalAmount": "1"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Coarse sugar"
    }
  ],
  "instructions": [
    "Create the pie dough",
    "In a small bowl, whisk together the egg, 4 tablespoons of ice water and the vinegar until well blended.",
    "In a large bowl, whisk together the flour and salt. Cut the lard into the flour mixture until crumbly. Gradually add the egg mixture to the flour mixture while tossing with a fork until the dough holds together when pressed. If the mixture is too dry, slowly add additional ice water, one teaspoon at a time, just until the dough comes together.",
    "Chill",
    "Divide the dough in half. Shape each half into a disk. Wrap and refrigerate the disks for one hour or overnight.",
    "Make the filling",
    "Preheat the oven to 400°F. In a large bowl, stir together the sugar and tapioca. Add the rhubarb and strawberries, and toss to coat evenly. Let the mixture stand for 15 minutes.",
    "Roll out the dough",
    "On a lightly floured surface, roll one dough disk into an 1/8-inch-thick circle. Transfer the crust to a 9-inch pie plate. Trim the crust so it’s even with the rim.",
    "Assemble the pie",
    "Add the filling to the pie crust. Dot the top of the filling with the butter.",
    "Roll the remaining dough disk into an 1/8-inch-thick circle, and place it over the filling. Trim the pie crust, seal it with the edge of the bottom pie crust, and flute the edge.",
    "Cut slits in the top of the crust. Brush the top with the milk, and sprinkle with coarse sugar.",
    "Editor’s Tip: If you want to get fancy with your fluting, learn how to make decorative pie crusts.",
    "Bake the pie",
    "Place the pie on a baking sheet to catch any drips, and bake for 20 minutes. Reduce the oven setting to 350°. Continue baking until the crust is golden brown and the filling is bubbly, 45 to 55 minutes. Cool the pie completely on a wire rack.",
    "Editor’s Tip: Add a pie crust shield to the top of your pie if the crust is browning too quickly.",
    "How to Store Strawberry-Rhubarb Pie",
    "Cool the pie completely to room temperature, then cover the pie in storage wrap. For the best-tasting strawberry-rhubarb pie, store it at room temperature for up to two days. You could also store this strawberry-rhubarb pie for up to five days in the refrigerator, but refrigeration can make the flavor fade. If you do opt for the refrigerator, let the pie come to room temperature before eating.",
    "Can you freeze strawberry-rhubarb pie?",
    "Yes, you can freeze strawberry-rhubarb pie. Fruit pies can be wrapped tightly and then frozen (best frozen whole, not cut into slices) for up to two months. If you only have slices left, allow them to cool completely to room temperature, then place them in an airtight container, and freeze for up to two months.",
    "In a small bowl, whisk egg, 4 tablespoons ice water and vinegar until blended. In a large bowl, mix flour and salt; cut in lard until crumbly. Gradually add egg mixture, tossing with a fork, until dough holds together when pressed. If mixture is too dry, slowly add additional ice water, 1 teaspoon at a time, just until dough comes together.",
    "Divide dough in half. Shape each into a disk; wrap and refrigerate 1 hour or overnight.",
    "Preheat oven to 400°. In a large bowl, mix sugar and tapioca. Add rhubarb and strawberries; toss to coat evenly. Let stand 15 minutes.",
    "On a lightly floured surface, roll half the dough to a 1/8-in.-thick circle; transfer to a 9-in. pie plate. Trim crust even with rim.",
    "Add filling; dot with butter. Roll remaining dough to a 1/8-in.-thick circle. Place over filling. Trim, seal and flute edge. Cut slits in top. Brush milk over top crust; sprinkle with coarse sugar. Place pie on a baking sheet; bake 20 minutes.",
    "Reduce oven setting to 350°. Bake 45-55 minutes longer or until crust is golden brown and filling is bubbly. Cool pie on a wire rack."
  ],
  "tags": [
    "dessert",
    "rhubarb",
    "quick"
  ],
  "yield": "8 servings",
  "image": "/images/recipes/best-strawberry-rhubarb-pie.jpg",
  "prepTime": "50 min",
  "cookTime": "65 min"
}