{
  "slug": "brownie-in-a-mug",
  "title": "Brownie in a Mug",
  "description": "Delicious brownie in a mug recipe",
  "ingredients": [
    {
      "amount": 2,
      "unit": "tablespoons",
      "name": "butter, mild extra virgin olive oil, or neutral oil",
      "_originalAmount": "2"
    },
    {
      "amount": 0.25,
      "unit": "cup",
      "name": "(30g) all-purpose flour",
      "_originalAmount": "1/4"
    },
    {
      "amount": 3,
      "unit": "tablespoons",
      "name": "(35g) sugar",
      "_originalAmount": "3"
    },
    {
      "amount": 2,
      "unit": "tablespoons",
      "name": "(13g) natural unsweetened cocoa powder",
      "_originalAmount": "2"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Pinch kosher salt"
    },
    {
      "amount": 0,
      "unit": "pinch",
      "name": "cinnamon, optional",
      "_originalAmount": "Tiny"
    },
    {
      "amount": 3,
      "unit": "tablespoons",
      "name": "(44ml) milk, water, or coffee",
      "_originalAmount": "3"
    },
    {
      "amount": 0.125,
      "unit": "teaspoon",
      "name": "vanilla extract",
      "_originalAmount": "1/8"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Ice cream, whipped cream, or heavy cream, for serving"
    }
  ],
  "instructions": [
    "Melt the butter, if using:",
    "Put the butter in a small microwave-safe bowl or ramekin, and microwave at 50% power (power level 5 on most microwaves) for 30 seconds. If it’s not melted after that, continue to microwave in 10-seconds bursts until it is.",
    "This step is unnecessary if you're using extra virgin olive oil or a neutral oil.",
    "Annika Panikker",
    "Place the flour, sugar, cocoa, salt (if using unsalted butter), and optional cinnamon in a microwave-safe ceramic mug. Stir with a fork until it resembles brown sand and there are no clumps.",
    "Annika Panikker",
    "Add the wet ingredients and stir:",
    "Stir in the butter (or oil) with a fork until a paste forms.",
    "Then add the milk (or water or coffee) and vanilla. Stir with the same fork until smooth. The batter may look a little thin, but don’t worry—that’s how it’s supposed to be.",
    "Annika Panikker",
    "Cook in the microwave:",
    "Microwave, uncovered, on high power for 1 minute.",
    "You may need to adjust the time for less or more powerful microwaves. If you don't know the power level on your microwave, start with 1 minute and continue cooking in 10-second increments until the brownie is done. For a 1000-watt microwave 1 minute is good; for 1650-watt microwaves, we recommend 1 minute and 10 seconds.",
    "After cooking, the brownie should still look a tad moist, not dry. Some wet-looking spots are okay; those will set up as the brownie rests.",
    "Let the brownie rest for 4 minutes. The inside of the brownie is very hot and still cooking, even though it’s not in the microwave. It may be hard, but the wait is worth it! It gives the brownie a better flavor and texture.",
    "Annika Panikker",
    "Top with ice cream:"
  ],
  "tags": [
    "dessert"
  ],
  "yield": "Serving 1 serving",
  "image": "/images/recipes/brownie-in-a-mug.jpg",
  "prepTime": "3 mins",
  "cookTime": "2 mins"
}