{
  "slug": "chicken-fried-rice",
  "title": "Chicken Fried Rice",
  "description": "Delicious chicken fried rice recipe",
  "ingredients": [
    {
      "amount": 0,
      "unit": "",
      "name": "3/4 pound boneless skinless chicken thighs"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 teaspoon salt, divided"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "3 tablespoons canola oil (or any high heat oil), divided"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "3 large eggs, whisked"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "2/3 cup yellow onions, diced"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "2 cloves garlic, minced"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "2 teaspoons minced ginger"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 large carrot, peeled and diced"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "2/3 cup frozen peas, rinsed under warm tap water for a few seconds thaw"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "4 cups cooked jasmine rice (preferably leftover from at least a day before, see Recipe Note)"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "2 scallions, sliced (separate the white and light green parts from the dark green part)"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1/2 teaspoon Chinese five-spice powder, optional"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "2 1/2 tablespoons soy sauce or tamari"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 teaspoon sesame oil"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "msg dunno how much"
    }
  ],
  "instructions": [
    "Prepare the chicken:",
    "Chop the chicken into small 1/4-inch to 1/2-inch cubes. Sprinkle 1/2 teaspoon of salt over the chicken and mix to combine. Set the chicken aside for about 10 minutes (I usually use this time to chop all the vegetables).",
    "Scramble the egg:",
    "Heat a wok or large sauté pan over medium-high heat. Swirl in a tablespoon of oil and add the whisked eggs. Use a spatula to quickly scramble the eggs, breaking the curds into smaller pieces as they come together. Transfer the eggs to a plate.",
    "Cook the chicken:",
    "Add another tablespoon of oil in the wok or pan. Add the chicken and cook for 4 to 5 minutes, stirring occasionally. Turn off the heat and transfer the cooked chicken to a plate.",
    "Using your spatula, scrape off any chicken bits that are still stuck to the wok so they don't burn during the next step. You can also use paper towels to wipe down your wok or pan.",
    "Cook the vegetables:",
    "Swirl 1 tablespoon of oil into the wok over medium-high heat. Add the diced onions and cook them for 1 minute, until they start to soften. Mix in the minced garlic and ginger and cook until fragrant, about 30 seconds. Add the diced carrots and cook for 2 minutes, stirring frequently. Add 1/2 teaspoon salt and the peas, and stir to incorporate.",
    "Cook the rice:",
    "Add the rice to the wok or pan on top of the vegetables and stir to combine. Using the back of your spatula, smash any large chunks of rice to break them apart. Add the white and green parts of the sliced scallions (save the dark green parts) and five-spice powder. Stir to incorporate. If the rice starts to stick to the pan, stir in a little more oil.",
    "Drizzle the soy sauce and sesame oil over the rice and stir to incorporate. Stir in the cooked chicken, scrambled eggs, and the dark parts of the scallions. Stir briefly to bring it together, and cook for another 1 to 2 minutes.",
    "Taste, and add more soy sauce if necessary. Serve immediately.",
    "Did you love the recipe? Let us know with a rating and review!"
  ],
  "tags": [
    "chicken",
    "dessert",
    "rice",
    "quick"
  ],
  "yield": "6 to 8 servings",
  "image": "/images/recipes/chicken-fried-rice.jpg",
  "prepTime": "10 mins",
  "cookTime": "15 mins"
}