{
  "slug": "crispy-rhubarb-lemon-chicken-bake",
  "title": "Crispy Rhubarb Lemon Chicken Bake",
  "description": "Delicious crispy rhubarb lemon chicken bake recipe",
  "ingredients": [
    {
      "amount": 0,
      "unit": "",
      "name": "For the Chicken Marinade:"
    },
    {
      "amount": 0.25,
      "unit": "cup",
      "name": "creamy balsamic dressing or vinaigrette",
      "_originalAmount": "¼"
    },
    {
      "amount": 0.25,
      "unit": "cup",
      "name": "tangy BBQ sauce (gluten free)",
      "_originalAmount": "¼"
    },
    {
      "amount": 2,
      "unit": "cloves",
      "name": "",
      "_originalAmount": "2 garlic"
    },
    {
      "amount": 0.5,
      "unit": "teaspoon",
      "name": "salt",
      "_originalAmount": "½"
    },
    {
      "amount": 0.5,
      "unit": "teaspoon",
      "name": "black pepper",
      "_originalAmount": "½"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "2 -3 rhubarb stalks, shaved/peeled (Keep the shavings for topping)"
    },
    {
      "amount": 0.25,
      "unit": "cup",
      "name": "maple syrup",
      "_originalAmount": "¼"
    },
    {
      "amount": 1,
      "unit": "tablespoon",
      "name": "lemon juice",
      "_originalAmount": "1"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "For the Lemon Chicken bake and Crispy Rhubarb:"
    },
    {
      "amount": 1.5,
      "unit": "pounds",
      "name": "skinless boneless chicken thighs (about 5 small thighs)",
      "_originalAmount": "1 ½"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 lemon"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Olive oil as needed for the skillet and to toss rhubarb shavings"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Salt to taste"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Pepper to taste"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Rhubarb shavings"
    },
    {
      "amount": 0,
      "unit": "teaspoon",
      "name": "lemon garlic seasoning or lemon pepper",
      "_originalAmount": "Optional: ¼"
    },
    {
      "amount": 1,
      "unit": "cup",
      "name": "pearled onions",
      "_originalAmount": "1"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Pinch of tarragon leaves or thyme to garnish"
    }
  ],
  "instructions": [
    "Preheat the oven to 375°F.",
    "Clean the rhubarb stalks, and trim the ends.",
    "Using a vegetable peeler, peel the red skin of the rhubarb to create shavings. (See blog post.) Set the shavings aside.",
    "Place 2-3 small rhubarb stalks, BBQ sauce, balsamic dressing, maple syrup, and seasonings in a blender. Pulse until creamy.",
    "Clean and trim the chicken thighs. Set the chicken aside.",
    "Add 1 Tablespoon of olive oil to an oven-safe or cast iron skillet. (A Dutch oven can be used as well.)",
    "Add the marinade and chicken thighs to the skillet. Squeeze lemon juice on top.",
    "Bring the marinade to a quick boil. Reduce the heat or turn it off completely when the edges begin to to caramelize on the pan.",
    "Flip the chicken thighs over, and place lemon slices on top of each thigh.",
    "Add 1 cup of peeled pearled onions to the skillet. Drizzle them with olive oil, and add salt and pepper to taste.",
    "Transfer the skillet to the oven, and bake at 375° F for 10 minutes.",
    "While the chicken is baking, season the rhubarb shavings with olive oil, salt, pepper, and lemon garlic or lemon pepper, if using.",
    "Add the shavings to the skillet with the chicken. Bake for 15 minutes, tossing the shavings halfway through. Thinner shavings will cook faster.",
    "Once the chicken and rhubarb shavings are fully cooked and crispy, remove the skillet from the oven.",
    "Add more marinade on top of the chicken, and top each thigh with the rhubarb shavings.",
    "Add salt and pepper to taste, and sprinkle with fresh thyme to garnish.",
    "Serve with pearled onions.",
    "Next add your lemon slices to your chicken and pop it in oven for just 20 minutes. BUT WAIT!!!! Here’s the EPIC part ya’ll. Take those shavings, toss in oil, pepper, garlic, salt, and place on baking sheet in oven (with the chicken) and bake the last 10-15 minutes with the chicken. They should get crispy! I added veggies in the oven while it was all cooking too. Saving time. Per usual. Anyway, the crispy rhubarb shavings totally make the dish. You top your lemon chicken bake with them and dig it. Like whoa.. so so fun and tasty!"
  ],
  "tags": [
    "chicken",
    "rhubarb",
    "quick"
  ],
  "yield": "Yield: 5",
  "image": "/images/recipes/crispy-rhubarb-lemon-chicken-bake.jpg",
  "prepTime": "15 minutes",
  "cookTime": "25 minutes"
}