{
  "slug": "crock-pot-teriyaki-chicken",
  "title": "Crock Pot Teriyaki Chicken",
  "description": "Delicious crock pot teriyaki chicken recipe",
  "ingredients": [
    {
      "amount": 0,
      "unit": "",
      "name": "SLOW COOK"
    },
    {
      "amount": "1 1/2",
      "unit": "pounds",
      "name": "boneless, skinless chicken thighs"
    },
    {
      "amount": "2/3",
      "unit": "cup",
      "name": "low-sodium soy sauce"
    },
    {
      "amount": "3",
      "unit": "tablespoons",
      "name": "rice vinegar"
    },
    {
      "amount": "3",
      "unit": "tablespoons",
      "name": "honey"
    },
    {
      "amount": "3",
      "unit": "tablespoons",
      "name": "brown sugar"
    },
    {
      "amount": "1",
      "unit": "clove",
      "name": "garlic minced"
    },
    {
      "amount": "1",
      "unit": "tablespoon",
      "name": "minced fresh ginger"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "SAUCE"
    },
    {
      "amount": "2",
      "unit": "tablespoons",
      "name": "water"
    },
    {
      "amount": "1",
      "unit": "tablespoon",
      "name": "cornstarch"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Toasted sesame seeds for serving"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Chopped green onions for serving"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Prepared brown rice quinoa, or other whole grain, for serving"
    }
  ],
  "instructions": [
    "Add the chicken to a slow cooker.",
    "Whisk the sauce ingredients together, then pour it over the chicken.",
    "Cook on HIGH for 2 hours or on LOW for 4 hours. Shred the chicken. Strain the sauce into a saucepan.",
    "Whisk the cornstarch slurry into the saucepan, cooking over medium-high heat until thickened. Remove it from the heat.",
    "Stir the chicken into the sauce. Serve with rice or quinoa, sesame seeds, and green onions. DIG IN!",
    "Storage Tips",
    "To Store. Refrigerate chicken in an airtight storage container for up to 4 days.",
    "To Reheat. Rewarm leftovers in a skillet on the stovetop over medium-low heat or in the microwave.",
    "To Freeze. Freeze teriyaki chicken in an airtight freezer-safe storage container for up to 3 months. Let thaw overnight in the refrigerator before reheating.",
    "Place the chicken thighs in the bottom of a 6-quart or larger slow cooker.",
    "In a medium bowl or large measuring cup, whisk together the soy sauce, rice vinegar, honey, brown sugar, garlic, and ginger. Pour over the chicken thighs.",
    "Cover and cook on high for 2 hours or low for 4 hours, until the chicken is tender and cooked through. Remove the chicken to a plate and shred with two forks. Strain the cooking liquid through a mesh sieve and into a medium saucepan.",
    "In a small bowl, whisk together the cornstarch and water until smooth. Add to the strained cooking liquid, whisk to incorporate, then heat the saucepan over medium high, stirring constantly until the sauce bubbles. Continue cooking and stirring until glossy and thickened, 1 to 2 minutes. Remove from heat.",
    "Add the chicken to the sauce. Toss to coat. Serve warm with rice or quinoa, garnished with sesame seeds and green onions as desired."
  ],
  "tags": [
    "chicken",
    "rice",
    "slow-cooker"
  ],
  "yield": "4 servings",
  "image": "/images/recipes/crock-pot-teriyaki-chicken.jpg",
  "prepTime": "10 mins",
  "cookTime": "4 hrs"
}