{
  "slug": "never-fail-scalloped-potatoes",
  "title": "Never-Fail Scalloped Potatoes",
  "description": "Delicious never-fail scalloped potatoes recipe",
  "ingredients": [
    {
      "amount": 2,
      "unit": "tablespoons",
      "name": "butter",
      "_originalAmount": "2"
    },
    {
      "amount": 3,
      "unit": "tablespoons",
      "name": "all-purpose flour",
      "_originalAmount": "3"
    },
    {
      "amount": 1,
      "unit": "teaspoon",
      "name": "salt",
      "_originalAmount": "1"
    },
    {
      "amount": 0.25,
      "unit": "teaspoon",
      "name": "pepper",
      "_originalAmount": "1/4"
    },
    {
      "amount": 1,
      "unit": "cups",
      "name": "fat-free milk",
      "_originalAmount": "1-1/2"
    },
    {
      "amount": 0.5,
      "unit": "cup",
      "name": "shredded reduced-fat cheddar cheese",
      "_originalAmount": "1/2"
    },
    {
      "amount": 2,
      "unit": "pounds",
      "name": "potatoes, peeled and thinly sliced (about 4 cups)",
      "_originalAmount": "2"
    },
    {
      "amount": 1,
      "unit": "cup",
      "name": "thinly sliced onions, divided",
      "_originalAmount": "1"
    }
  ],
  "instructions": [
    "Make the sauce",
    "Heat your oven to 350°F. While it’s coming to temperature, melt the butter in a small saucepan. Combine the flour, salt and pepper, and stir the flour mixture into the butter to make a smooth, lump-free roux. Gradually whisk in the cold milk. Bring the sauce to a boil and stir until it thickens which should take about two minutes. Remove the saucepan from the heat and stir in the cheese until it’s melted.",
    "Assemble the dish",
    "Spray or grease an 8 inch square baking dish. Arrange half of the potatoes evenly in the bottom of the dish, then layer it with half of the onions and half of the cheese sauce. Repeat the same layers to fill the baking dish.",
    "Bake the scalloped potatoes",
    "Bake the potatoes covered for 50 minutes. Remove the cover and bake until the sauce is bubbly and the potatoes are tender, about 10 to 15 minutes longer.",
    "Preheat oven to 350°. In a small saucepan, melt butter; stir in flour, salt and pepper until smooth. Gradually whisk in milk. Bring to a boil, stirring constantly; cook and stir until thickened, about 2 minutes. Remove from heat; stir in cheese until melted.",
    "Coat an 8-in. square baking dish with cooking spray. Place half of the potatoes in dish; layer with 1/2 cup onion and half of the cheese sauce. Repeat layers.",
    "Bake, covered, 50 minutes. Uncover; bake until bubbly and potatoes are tender, 10-15 minutes longer."
  ],
  "tags": [],
  "yield": "6 servings",
  "image": "/images/recipes/never-fail-scalloped-potatoes.jpg",
  "prepTime": "25 min",
  "cookTime": "1 hour"
}