{
  "slug": "peach-salsa",
  "title": "Peach Salsa",
  "description": "Delicious peach salsa recipe",
  "ingredients": [
    {
      "amount": "10",
      "unit": "large",
      "name": "ripe peaches ~4 lbs/1.8kg (8 cups peeled, pitted, and finely diced)"
    },
    {
      "amount": "¾",
      "unit": "cup",
      "name": "(180ml) lime juice, fresh (6-7 limes) or bottled, divided"
    },
    {
      "amount": "5",
      "unit": "large",
      "name": "fresh tomatoes ~2½ lbs/1.15kg (4 cups peeled, seeded, and chopped)"
    },
    {
      "amount": "2",
      "unit": "large",
      "name": "orange or yellow sweet bell peppers, or one of each, ~2½ cups finely diced"
    },
    {
      "amount": "2",
      "unit": "medium",
      "name": "onions, finely diced ~2 cups"
    },
    {
      "amount": "2",
      "unit": "large",
      "name": "jalapeño peppers, seeded and finely diced ~½ cup"
    },
    {
      "amount": "6 cloves garlic, minced 2",
      "unit": "tablespoons",
      "name": ""
    },
    {
      "amount": "1",
      "unit": "tablespoon",
      "name": "ground cumin"
    },
    {
      "amount": "1",
      "unit": "tablespoon",
      "name": "hot red pepper flakes/chili flakes/crushed red pepper"
    },
    {
      "amount": "1½",
      "unit": "tablespoons",
      "name": "(4½ teaspoons) smoked paprika (mild)"
    },
    {
      "amount": "1½",
      "unit": "teaspoons",
      "name": "fine sea salt"
    },
    {
      "amount": "¾",
      "unit": "cup",
      "name": "(180ml) white vinegar"
    },
    {
      "amount": "2",
      "unit": "tablespoons",
      "name": "cornstarch"
    }
  ],
  "instructions": [
    "Bring a pot of water to a boil. Prepare a large bowl filled with ice cold water. Once the water is boiling, drop in half the peaches and let them boil for 60 seconds, then remove them with a slotted spoon right into the cold water. Blanch the rest of the peaches the same way. Don't discard the water.",
    "After a short cool-down in the cold water, you can easily slip the skins off the peaches with your hands. Cut the peaches in half around the pit, twist the two halves in opposite directions to separate them, then remove the pit. Slice the peaches thinly, then dice them into small bits about as big as corn kernels. Toss them with ½ cup (120ml) of the lime juice as you cut them, and set them aside. (The lime juice prevents browning and adds flavour.)",
    "Blanch the tomatoes in the same water: reheat the water, cut an X into the bottom of each tomato (to allow the skins to expand and loosen), then drop them into the boiling water and let them boil for 60 seconds. Remove them, drop them into the cold water, and then peel off the outer skins and cut out the cores. Cut the tomatoes in half horizontally (around their equators), then use your finger to scoop out and discard the juices and seeds from each section. Set the tomato halves, cut side down, onto a plate to drain, then chop them coarsely.",
    "Prepare the rest of the vegetables: Core and seed the bell peppers and finely dice them. Finely dice the onions. Core and seed the jalapeños and finely dice them. Mince the garlic.",
    "Place all the chopped vegetables except the peaches into a large heavy-bottomed pot.",
    "Add the cumin, red pepper flakes, smoked paprika, salt, vinegar, and remaining ¼ cup (60ml) of the lime juice. Bring the mixture to a boil. Then reduce the heat slightly and continue to cook it at a low boil, uncovered, for 15 minutes, stirring often to prevent scorching, until some of the liquid has evaporated and the mixture is slightly thickened.",
    "Remove the pot from the heat.",
    "Stir the cornstarch into the chopped peaches, then add the peaches to the cooked vegetable ingredients, stirring well to combine everything. (Don't cook it again, so the peaches stay fresh and chunky - they will cook as the jars are processed.)",
    "Ladle the peach salsa into sterilized pint (500ml) canning jars, filling them to within ½ inch (1cm) of the top. Run a butter knife down the sides to release any trapped air bubbles. Wipe the rims of the jars with a clean damp cloth, top with the hot, sterilized snap lids, screw on the lid rings so they are finger tight (only as tight as you can get them using just your thumb and index finger).",
    "Then process the jars in a boiling water bath for 15 minutes (10 minutes if you use smaller half pint/250ml jars).",
    "How to Process Jars for Canning",
    "Set the jars into a canner with a rack or into a large deep stock pot with a clean dishcloth laid flat in the bottom. Put in only as many jars as will fit easily. You may need to do several batches. Pour hot water into the pot until it covers the jars by about 1 inch (2.5cm). Bring to a boil. Cover the pot, and turn the heat down a bit so the jars continue to boil vigorously but don’t boil over. Start timing and boil them for 15 minutes. Then remove the jars with canning tongs and set them onto a towel on the counter. (The towel prevents the temperature shock that come from hot jars set onto a cold counter.) Don’t disturb them until they are completely cool. Check the seals: if the jar lids have been sucked down so they don’t move when you press a finger into the center of them, the jars are sealed. If the lids are still slightly bulged upward and you can move them up and down when you press with a finger, they didn’t seal and should be stored in the fridge to use up within the next month or two.",
    "Tighten the rings on the sealed jars and store them in a cool dark place for up to several years.",
    "Leave the jars for at least one week for the flavours to fully develop, before consuming."
  ],
  "tags": [
    "dessert"
  ],
  "yield": "7 pint jars",
  "image": "/images/recipes/peach-salsa.jpg",
  "prepTime": "1 hr",
  "cookTime": "30 mins"
}