{
  "slug": "pineapple-upside-down-cake",
  "title": "Pineapple Upside Down Cake",
  "description": "Delicious pineapple upside down cake recipe",
  "ingredients": [
    {
      "amount": 0,
      "unit": "",
      "name": "TOPPING"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1/4 cup (60g) unsalted butter, melted"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1/2 cup (100g) packed light or dark brown sugar"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "8–10 pineapple slices (see note)*"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "15–20 maraschino cherries (see note)*"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "CAKE"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 and 1/2 cups (177g) cake flour (spooned &amp; leveled)"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 teaspoon baking powder"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1/4 teaspoon baking soda"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1/2 teaspoon salt"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "6 Tablespoons (85g) unsalted butter, softened to room temperature"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "3/4 cup (150g) granulated sugar"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "2 large egg whites, at room temperature"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1/3 cup (80g) sour cream, at room temperature"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 teaspoon pure vanilla extract"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1/4 cup (60ml) pineapple juice, at room temperature (use leftover from can)"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "2 Tablespoons (30ml) milk, at room temperature"
    }
  ],
  "instructions": [
    "Preheat oven to 350°F (177°C).",
    "Prepare topping first: Pour 1/4 cup melted butter into an ungreased 9×2 inch pie dish or round cake pan. (Make sure the pan is 2 inches deep. I recommend this pie dish, which is 1.8 inches deep but I never have an overflow issue.) Sprinkle brown sugar evenly over butter. Blot any excess liquid off the fruit with a clean towel or paper towel. (The wetter the fruit, the more likely the cake could overflow or the topping could seep over the sides when inverted.) Arrange about 6-7 blotted pineapple slices and all the cherries on top of the brown sugar. I like to halve 3 pineapple rings and arrange them around the sides of the pan, too. See my photo and video above for a visual of the arranged topping. Place pan in the refrigerator for a few minutes as you prepare the cake batter. This helps solidify or “set” the topping’s arrangement.",
    "Make the cake batter: Whisk the cake flour, baking powder, baking soda, and salt together. Set aside.",
    "Using a handheld or stand mixer fitted with a paddle or whisk attachment, beat the butter on high speed until smooth and creamy, about 1 minute. Add the sugar and beat on high speed until creamed together, about 1 minute. Scrape down the sides and up the bottom of the bowl with a rubber spatula as needed. On high speed, beat in the egg whites until combined, then beat in the sour cream and vanilla extract. Scrape down the sides and up the bottom of the bowl as needed. Pour the dry ingredients into the wet ingredients. Turn the mixer onto low speed and as the mixer runs, slowly pour in the pineapple juice and milk. Beat on low speed just until all of the ingredients are combined. Do not over-mix. You may need to whisk it all by hand to make sure there are no lumps at the bottom of the bowl. The batter will be slightly thick.",
    "Remove topping from the refrigerator. Pour and spread cake batter evenly over topping.",
    "Bake for 43-48 minutes, tenting foil on top of the cake halfway through bake time to prevent the top from over-browning before the center has a chance to fully cook. The cake is done when a toothpick inserted into the center of the cake comes out mostly clean—a couple moist crumbs are OK. Don’t be alarmed if your cake takes longer or if the cake rises up and sticks to the foil. (We serve the cake upside down anyway!)",
    "Remove cake from the oven and cool on a wire rack for just 20 minutes. Invert the slightly cooled cake onto a cake stand or serving plate. Some of the juices from the topping will seep over the sides—that’s ok. You can slice and serve the cake warm, but the slices will be messy. I find it’s best to cool the cake completely at room temperature before slicing and serving. Do not refrigerate the cake to speed up the cooling process because it could end up tasting overly dense.",
    "Cover leftover slices and store for up to 3 days in the refrigerator or 3 months in the freezer. Thaw at room temperature. I don’t recommend freezing the cake as a whole because the topping arrangement doesn’t thaw very nicely. See make ahead instructions below.",
    "Pineapple & Cherries: Traditional recipes use canned pineapple and maraschino cherries. I recommend 1 20 ounce can of pineapple rings/slices, which usually holds 10 rings/slices. You can use fresh pineapple rings/slices and fresh cherries if desired. If using fresh cherries, I recommend halving them. Blot excess liquid off the fresh fruit just as I instruct in step 2. Fresh or canned pineapple chunks, tidbits, and/or crushed pineapple will create a messy topping that could spill over the sides when the cake is inverted. I recommend rings/slices because they are larger.",
    "Sour Cream & Milk: Full fat sour cream and whole milk are strongly recommended for the best taste and texture. A full fat plain yogurt would work instead of the sour cream, though the cake may not taste as tender. Same goes with a lower fat or nondairy milk.",
    "Why is everything at room temperature? All refrigerated items should be at room temperature so the batter mixes together easily and evenly. Read more about why room temperature ingredients are important."
  ],
  "tags": [
    "dessert"
  ],
  "yield": "Serves 8-10",
  "image": "/images/recipes/pineapple-upside-down-cake.jpg",
  "prepTime": "25 minutes",
  "cookTime": "45 minutes"
}