{
  "slug": "pulled-chicken-with-tomatoes-vinegar-and-brown-sugar",
  "title": "Pulled Chicken with Tomatoes, Vinegar, and Brown Sugar",
  "description": "Delicious pulled chicken with tomatoes, vinegar, and brown sugar recipe",
  "ingredients": [
    {
      "amount": "1/2",
      "unit": "cup",
      "name": "chicken broth"
    },
    {
      "amount": "1 1/2",
      "unit": "tbsp",
      "name": "apple cider vinegar"
    },
    {
      "amount": "4",
      "unit": "small",
      "name": "roma or plum tomatoes quartered"
    },
    {
      "amount": "6",
      "unit": "medium",
      "name": "scallions trimmed and thinly sliced (1½ cups)"
    },
    {
      "amount": "2",
      "unit": "tbsp",
      "name": "mild paprika"
    },
    {
      "amount": "2",
      "unit": "tsp",
      "name": "onion powder"
    },
    {
      "amount": "1",
      "unit": "tsp",
      "name": "garlic powder"
    },
    {
      "amount": "1",
      "unit": "tsp",
      "name": "dried thyme"
    },
    {
      "amount": "1",
      "unit": "tsp",
      "name": "table salt"
    },
    {
      "amount": "1/2",
      "unit": "tsp",
      "name": "ground allspice"
    },
    {
      "amount": "1/2",
      "unit": "tsp",
      "name": "ground black pepper"
    },
    {
      "amount": "12",
      "unit": "tsp",
      "name": "ground dried cayenne"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Five 5- to 6-ounce boneless skinless chicken breasts"
    },
    {
      "amount": "1/2",
      "unit": "cup",
      "name": "ketchup"
    },
    {
      "amount": "2",
      "unit": "tbsp",
      "name": "light brown sugar"
    },
    {
      "amount": "2",
      "unit": "tbsp",
      "name": "honey"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "4 to 6 hamburger buns"
    }
  ],
  "instructions": [
    "Stir the broth, vinegar, tomatoes, and scallions in the insert set in a 5- or 6-quart Instant Pot. Set a pressure-and-food-safe rack or trivet in the insert, moving the tomatoes out of the way.",
    "Mix the paprika, onion powder, garlic powder, thyme, salt, allspice, black pepper, and cayenne in a small bowl until uniform. Use clean hands to rub this spice mixture all over the chicken breasts. Set them on the rack in as close to one even layer as you can. If they must overlap, make sure thin ends go over thin ends. (And wash your hands carefully with lots of soap because they now have cayenne on them!)",
    "Whisk the ketchup, brown sugar, and honey in a small bowl (maybe even the same bowl the spices were in) until the brown sugar dissolves. Pour and scrape this mixture over the chicken breasts, keeping it on the meat without letting it fall into the liquid below. Lock the lid onto the cooker.",
    "Set the Instant Pot for PRESSURE COOK or MANUAL on LOW pressure. Make sure the valve is closed. Set the time for 25 minutes with the KEEP WARM setting off.",
    "When the pot has finished cooking, turn it off and let the pressure return to normal naturally, about 15 minutes. Unlatch the lid and open the cooker. Transfer the chicken breasts to a nearby cutting board. Remove the rack or trivet from the pot. (Kitchen tongs work best for all of this.)",
    "Press SAUTÉ and set to MEDIUM, NORMAL, OR CUSTOM 300°F for 10 minutes.",
    "Stir the sauce as it comes to a simmer. Cook, stirring quite often, until the sauce has reduced to about a third of its volume from when you opened the pot, about 4 minutes. Turn off the SAUTÉ function.",
    "Use two forks to shred the chicken breasts. Stir this shredded chicken into the sauce in the pot until well combined. Serve warm in hamburger buns."
  ],
  "tags": [
    "chicken",
    "instant-pot",
    "quick"
  ],
  "yield": "Servings 4-6 servings",
  "image": "/images/recipes/pulled-chicken-with-tomatoes-vinegar-and-brown-sugar.jpg",
  "prepTime": "10 minutes",
  "cookTime": "50 minutes"
}