{
  "slug": "quiche",
  "title": "Quiche",
  "description": "Delicious quiche recipe",
  "ingredients": [
    {
      "amount": 0,
      "unit": "",
      "name": "1 unbaked Flaky Pie Crust (what I used) or All Butter Pie Crust*"
    },
    {
      "amount": "4",
      "unit": "large",
      "name": "eggs"
    },
    {
      "amount": "1/2",
      "unit": "cup",
      "name": "whole milk*"
    },
    {
      "amount": "1/2",
      "unit": "cup",
      "name": "heavy cream or heavy whipping cream*"
    },
    {
      "amount": "1/4",
      "unit": "teaspoon",
      "name": "each salt and pepper*"
    },
    {
      "amount": "1",
      "unit": "cup",
      "name": "shredded or crumbled cheese such as feta, cheddar, goat cheese, or gruyere"
    },
    {
      "amount": "up to 2",
      "unit": "cups",
      "name": "add-ins (see recipe note)"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "optional toppings for serving: extra cheese, chopped herbs, hollandaise sauce, &amp; freshly ground pepper to taste"
    }
  ],
  "instructions": [
    "Prepare pie crust: I like to make sure my pie dough is prepared before I begin the quiche. Make pie dough the night before because it needs to chill in the refrigerator for at least 2 hours before rolling out and blind baking (next step).",
    "Roll out the chilled pie dough: On a floured work surface, roll out one of the disks of chilled dough (use the 2nd pie crust for another recipe). Turn the dough about a quarter turn after every few rolls until you have a circle 12 inches in diameter. Carefully place the dough into a 9-inch pie dish. Tuck it in with your fingers, making sure it is completely smooth. To make a lovely edge, I do not trim excess dough around the edges. Instead, fold the excess dough back over the edge and use your hands to mold the edge into a rim around the pie. Crimp the edges with a fork or use your fingers to flute the edges. Chill the pie crust in the refrigerator for at least 30 minutes and up to 5 days. Cover the pie crust with plastic wrap if chilling for longer than 30 minutes.",
    "While the crust is chilling, preheat oven to 375°F (190°C).",
    "Partially blind bake: Line the chilled pie crust with parchment paper. Fill with pie weights or dried beans. Make sure the weights are evenly distributed around the pie dish. Bake until the edges of the crust are starting to brown, about 15-16 minutes. Remove pie from the oven and carefully lift the parchment paper (with the weights) out of the pie. Prick holes all around the bottom crust with a fork. Return the pie crust to the oven. Bake until the bottom crust is just beginning to brown, about 7-8 minutes. Remove from the oven and set aside. (Crust can still be warm when you pour in the filling. You can partially pre-bake the crust up to 3 days ahead of time. Cover cooled crust tightly and refrigerate until ready to fill.)",
    "Reduce oven temperature to 350°F (177°C).",
    "In a large bowl with a handheld or stand mixer fitted with a whisk attachment, beat the eggs, whole milk, heavy cream, salt, and pepper together on high speed until completely combined, about 1 minute. Whisk in add-ins and then pour into crust.",
    "Bake the quiche until the center is just about set, about 45-55 minutes. Don’t over-bake. Use a pie crust shield to prevent the pie crust edges from over-browning. Allow to cool for 15 minutes. Top with optional toppings before slicing and serving, if desired. Or you can cool the quiche completely before serving—it’s fantastic at room temperature!",
    "This quiche makes great leftovers! Cover tightly and store in the refrigerator for up to 4 days."
  ],
  "tags": [
    "dessert",
    "baked"
  ],
  "yield": "Serves 8",
  "image": "/images/recipes/quiche.jpg",
  "prepTime": "2 hours",
  "cookTime": "1 hour"
}