{
  "slug": "rhubarb-buckwheat-scones",
  "title": "Rhubarb-Buckwheat Scones",
  "description": "Delicious rhubarb-buckwheat scones recipe",
  "ingredients": [
    {
      "amount": 0,
      "unit": "",
      "name": "6 ounces rhubarb, cut into ¼-inch slices if stalks are narrow, diced if large (1 ½ cups)"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "½ cup granulated sugar"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "¾ cup cold heavy cream, plus more for brushing"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 large egg, beaten"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 ¾ cups unbleached all-purpose flour, plus more for dusting"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "⅓ cup buckwheat flour"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "2 ¼ teaspoons baking powder"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 ¼ teaspoons kosher salt"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "6 tablespoons cold unsalted butter, cut into pieces"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Coarse sanding sugar or more granulated sugar, for sprinkling"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Strawberry butter or strawberry jam, for serving"
    }
  ],
  "instructions": [
    "Preheat oven to 425 degrees. Toss rhubarb with 1/4 cup granulated sugar; let stand, stirring occasionally, 20 minutes. Meanwhile, whisk together cream and egg. In a large bowl, whisk together both flours, remaining 1/4 cup granulated sugar, baking powder, and salt.",
    "Cut butter into flour mixture until it resembles coarse meal with a few pea-size pieces remaining. Reserve 1/3 cup rhubarb mixture; stir the rest into flour mixture.With a fork, stir cream mixture into flour mixture just until combined.",
    "Transfer dough to a lightly floured surface. Pat into a 1-inch-thick rectangle, about 6-by-7 1/2 inches. Cut into six 2-by-3 3/4-inch rectangles, then cut rectangles on the diagonal into triangles. Transfer to parchment-lined baking sheets; freeze 10 minutes. Brush tops with cream; top each with a few pieces of reserved rhubarb mixture. Sprinkle generously with sanding sugar and bake, rotating once halfway through, until golden, 20 to 25 minutes. Let cool completely; serve with berry butter. Scones are best eaten the same day, but can be stored in an airtight container at room temperature up to 1 day."
  ],
  "tags": [
    "dessert",
    "rhubarb"
  ],
  "yield": "12 scones",
  "image": "/images/recipes/rhubarb-buckwheat-scones.jpg"
}