{
  "slug": "rhubarb-custard-tart",
  "title": "Rhubarb Custard Tart",
  "description": "Delicious rhubarb custard tart recipe",
  "ingredients": [
    {
      "amount": 0,
      "unit": "",
      "name": "Dough"
    },
    {
      "amount": 1.5,
      "unit": "cups",
      "name": "unbleached all-purpose flour, plus more for dusting",
      "_originalAmount": "1 ½"
    },
    {
      "amount": 2,
      "unit": "teaspoons",
      "name": "sugar",
      "_originalAmount": "2"
    },
    {
      "amount": 1,
      "unit": "teaspoon",
      "name": "kosher salt (we use Diamond Crystal)",
      "_originalAmount": "1"
    },
    {
      "amount": 10,
      "unit": "tablespoons",
      "name": "cold unsalted butter, cut into small pieces",
      "_originalAmount": "10"
    },
    {
      "amount": 4,
      "unit": "tablespoons",
      "name": "ice-cold water",
      "_originalAmount": "4 to 5"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Filling"
    },
    {
      "amount": 1,
      "unit": "pound",
      "name": "rhubarb, halved lengthwise into ¾-inch stalks if thick",
      "_originalAmount": "1"
    },
    {
      "amount": 1.25,
      "unit": "cups",
      "name": "sugar",
      "_originalAmount": "1 ¼"
    },
    {
      "amount": 0.3333333333333333,
      "unit": "cup",
      "name": "unbleached all-purpose flour, plus more for dusting",
      "_originalAmount": "⅓"
    },
    {
      "amount": 0.5,
      "unit": "teaspoon",
      "name": "kosher salt (we use Diamond Crystal)",
      "_originalAmount": "½"
    },
    {
      "amount": 2,
      "unit": "large",
      "name": "eggs",
      "_originalAmount": "2"
    },
    {
      "amount": 0.5,
      "unit": "cup",
      "name": "heavy cream",
      "_originalAmount": "½"
    },
    {
      "amount": 1,
      "unit": "teaspoon",
      "name": "pure vanilla paste or extract",
      "_originalAmount": "1"
    }
  ],
  "instructions": [
    "Dough: Pulse flour, sugar, and salt in a food processor until combined. Add butter and pulse until mixture resembles coarse meal, with some pea-size pieces remaining. Drizzle 4 tablespoons ice water over mixture; pulse several times to combine. Add more water as needed, pulsing until mixture holds together when pinched. Shape dough into a rectangle and wrap in plastic. Refrigerate at least 1 hour and up to 1 day, or freeze up to 3 months; thaw completely in refrigerator before using.",
    "Preheat oven to 375°F. On a lightly floured surface, roll dough into a 12-by-15-inch rectangle, about 1/8 inch thick. Transfer to a 9-by-12 1/2-inch rimmed baking sheet or a fluted tart pan with a removable bottom, fitting dough into corners and folding over extra to create a double-layered edge. Refrigerate 15 minutes.",
    "Line dough with parchment and fill to top with dry rice or beans, or pie weights. Bake until edges are golden and bottom is beginning to dry out, 30 to 35 minutes. Remove parchment and pie weights; continue baking until golden brown on bottom, 10 to 12 minutes. Let cool 15 minutes.",
    "Filling: Meanwhile, cut rhubarb into 11-inch lengths (if some are shorter, that's okay). Using a sharp knife, score rhubarb along rounded sides on a diagonal at 2-inch intervals (this helps heat penetrate and break up the fibers, so the tart is easier to slice once cooked).",
    "In a medium bowl, whisk together 1 cup sugar, flour, salt, eggs, cream, and vanilla; pour mixture into cooled crust. Arrange rhubarb lengthwise over top, scored-sides up; sprinkle with remaining 1/4 cup sugar. Bake until tart is puffed, golden, and just set in center, 45 to 55 minutes.",
    "Let cool on a wire rack at least 1 hour before serving. To serve, run a spatula under tart to release from sheet, then slide onto a cutting board. Cut into squares; serve at room temperature or chilled. Tart is best eaten the day it's made, but can be refrigerated, covered, up to 1 day."
  ],
  "tags": [
    "dessert",
    "rice",
    "rhubarb"
  ],
  "yield": "10 to 12 serves",
  "image": "/images/recipes/rhubarb-custard-tart.jpg",
  "prepTime": "35 mins",
  "cookTime": "2 hrs 25 mins"
}