{
  "slug": "rhubarb-raspberry-cheesecake-squares",
  "title": "Rhubarb-Raspberry Cheesecake Squares",
  "description": "Delicious rhubarb-raspberry cheesecake squares recipe",
  "ingredients": [
    {
      "amount": "1",
      "unit": "stick",
      "name": "unsalted butter, melted, plus more, room temperature, for pan"
    },
    {
      "amount": "18 graham-cracker",
      "unit": "sheets",
      "name": ""
    },
    {
      "amount": "2 cups plus 2",
      "unit": "tablespoons",
      "name": "sugar"
    },
    {
      "amount": "16",
      "unit": "ounces",
      "name": "cream cheese, room temperature"
    },
    {
      "amount": "½",
      "unit": "cup",
      "name": "sour cream, room temperature"
    },
    {
      "amount": "½",
      "unit": "teaspoon",
      "name": "pure vanilla extract"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Pinch of coarse salt"
    },
    {
      "amount": "2",
      "unit": "large",
      "name": "eggs, room temperature, lightly beaten"
    },
    {
      "amount": "1 ½",
      "unit": "pounds",
      "name": "rhubarb stalks, 5 stalks trimmed and halved lengthwise, the rest chopped (1 ¾ cups)"
    },
    {
      "amount": "6",
      "unit": "ounces",
      "name": "fresh raspberries"
    },
    {
      "amount": "1",
      "unit": "tablespoon",
      "name": "fresh lemon juice"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 packet (¼ ounce) unflavored powdered gelatin"
    }
  ],
  "instructions": [
    "Preheat oven to 350 degrees. Butter a 9-by-13-inch baking pan; line with parchment, leaving a 2-inch overhang on long sides. Pulse graham crackers and 2 tablespoons sugar in a food processor until fine crumbs form. Transfer to a bowl; stir in melted butter.",
    "Press crumbs into bottom of pan. Bake crust until firm, about 15 minutes. Let cool on a wire rack. Reduce oven to 325 degrees.",
    "Beat cream cheese and sour cream on medium until smooth. Beat in 3/4 cup sugar, then beat in vanilla and salt. Add eggs and beat until smooth, scraping down bowl as needed. Pour mixture into crust; smooth top. Bake until just set, 25 to 35 minutes. Let cool completely. Chill until firm, 1 hour.",
    "Meanwhile, bring chopped rhubarb, raspberries, 1/4 cup sugar, lemon juice, and 1/4 cup water to a simmer, covered, in a small pot. Cook, stirring occasionally, just until rhubarb is softened, about 10 minutes. Pass mixture through a fine sieve into a bowl, pressing gently on solids. Skim foam from top of liquid (you should have a little more than 1 cup; add water, if needed).",
    "Bring 4 cups water and remaining 1 cup sugar to a boil in a large straight-sided skillet, stirring, until sugar is dissolved. Reduce heat to low; add rhubarb stalks (in 2 batches, if necessary). Simmer until slightly soft, 2 to 3 minutes. With 2 spatulas, carefully transfer stalks to a paper-towel-lined rimmed baking sheet; let drain.",
    "Arrange 4 rhubarb strips in a parallel fashion on cooled cheesecake, spacing evenly. Cut remaining strips in half lengthwise and fit in empty spaces.",
    "Sprinkle gelatin over 1/4 cup water; let soften 1 minute. Reheat raspberry syrup until simmering. Stir in gelatin until dissolved; gently pour over rhubarb strips. Refrigerate cake until set, at least 2 hours and preferably overnight.",
    "Cut into pieces, using a sawing motion to slice through rhubarb layer; wipe knife between cuts."
  ],
  "tags": [
    "dessert",
    "rhubarb"
  ],
  "yield": "20",
  "image": "/images/recipes/rhubarb-raspberry-cheesecake-squares.jpg",
  "prepTime": "1 hr",
  "cookTime": "4 hrs"
}