{
  "slug": "soft-and-chewy-oatmeal-chocolate-chip-cookies",
  "title": "Soft and Chewy Oatmeal Chocolate Chip Cookies",
  "description": "Delicious soft and chewy oatmeal chocolate chip cookies recipe",
  "ingredients": [
    {
      "amount": 0,
      "unit": "",
      "name": "1 and 1/2 cups (188g) all-purpose flour (spooned &amp; leveled)"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 teaspoon ground cinnamon (optional)"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 teaspoon baking soda"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "3/4 teaspoon salt"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 cup (2 sticks; 230g) unsalted butter, softened to room temperature"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 cup (200g) packed light or dark brown sugar"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1/2 cup (100g) granulated sugar"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "2 large eggs, at room temperature"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 Tablespoon (15ml) unsulphured or dark molasses (do not use blackstrap; I prefer Grandma’s brand)"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "2 teaspoons pure vanilla extract"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "3 cups (255g) old-fashioned whole rolled oats"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 and 3/4 cups semi-sweet chocolate chips*"
    }
  ],
  "instructions": [
    "Whisk the flour, cinnamon, baking soda, and salt together in a medium bowl. Set aside.",
    "In a large bowl using a hand mixer or a stand mixer fitted with a paddle attachment, beat the butter on medium-high speed until smooth, about 1 minute. Add the brown sugar and granulated sugar and beat on medium-high speed until creamed, about 2 minutes. Add the eggs, molasses, and vanilla and beat on high speed until combined, about 1 minute. Scrape down the sides and up the bottom of the bowl and beat again as needed to combine.",
    "Add the dry ingredients to the wet ingredients and mix on low until combined. With the mixer running on low speed, beat in the oats and both types of chocolate chips. Dough will be thick and sticky. Cover and chill the dough for at least 45 minutes in the refrigerator (and up to 4 days). If chilling for longer than a few hours, allow to sit at room temperature for at least 30 minutes before rolling and baking because the dough will be quite hard.",
    "Preheat oven to 350°F (177°C). Line baking sheets with parchment paper or silicone baking mats. Set aside.",
    "Use a large cookie scoop to scoop the cookie dough, about 3 Tablespoons of dough per cookie, and place 4 inches apart on the baking sheets. Bake for 13-14 minutes or until lightly browned on the sides. The centers will look very soft.",
    "Remove from the oven and allow cookies to cool on the baking sheet for 5 minutes before transferring to a wire rack to cool completely. While the cookies are still warm, I like to press a few more chocolate chips into the tops—this is only for looks!",
    "Cookies stay fresh covered at room temperature for up to 1 week."
  ],
  "tags": [
    "dessert",
    "baked",
    "chocolate"
  ],
  "yield": "Yield: 22 cookies",
  "image": "/images/recipes/soft-and-chewy-oatmeal-chocolate-chip-cookies.jpg",
  "prepTime": "1 hour",
  "cookTime": "14 minutes"
}