{
  "slug": "strawberry-rhubarb-crisp",
  "title": "Strawberry Rhubarb Crisp",
  "description": "Delicious strawberry rhubarb crisp recipe",
  "ingredients": [
    {
      "amount": 0,
      "unit": "",
      "name": "FOR THE FILLING:"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 pound rhubarb stalks, trimmed and sliced ½-inch thick"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "½ pound strawberries, hulled and quartered"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "½ cup granulated sugar"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1½ tablespoons cornstarch"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "1 teaspoon vanilla extract"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "FOR THE TOPPING:"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "¾ cup all-purpose flour, spooned into measuring cup and leveled-off with a knife"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "½ cup packed light brown sugar"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "2 tablespoons granulated sugar"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "¼ teaspoon salt"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "6 tablespoons unsalted butter, cut into ½-inch cubes"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "¾ cup old fashioned rolled oats"
    },
    {
      "amount": 0,
      "unit": "",
      "name": "Lightly sweetened whipped cream or vanilla ice cream, for serving (optional)"
    }
  ],
  "instructions": [
    "Quarter the strawberries and combine them with the rhubarb, sugar, cornstarch and vanilla. Stir until the fruit is evenly coated with the sugar mixture, and the sugar mixture is no longer white.",
    "Transfer the fruit mixture to a 2-quart baking dish (no need to butter it) and set aside while you prepare the topping.",
    "In the bowl of a food processor, combine the flour, brown sugar, granulated sugar and salt.",
    "Process until well combined, about 30 seconds. Add the cold butter.",
    "Pulse until the mixture resembles coarse crumbs, with a few pea-sized clumps of butter within.",
    "Transfer to a medium bowl and stir in the oats and chopped pecans.",
    "Stir to combine.",
    "Spoon the topping evenly over the fruit without packing it down.",
    "Bake for 45-55 minutes, until the fruit is bubbling around the edges and the topping is golden brown. Cool for 20 minutes before serving, then spoon into shallow bowls and serve with vanilla ice cream.",
    "Preheat the oven to 350°F.",
    "FOR THE FILLING:",
    "In a large bowl, combine the rhubarb, strawberries, sugar, cornstarch, and vanilla. Stir until the fruit is evenly coated with the sugar mixture, and the sugar mixture is no longer white.",
    "Transfer the fruit mixture to a 2-quart or 8-inch baking dish (no need to butter it) and set aside while you prepare the topping.",
    "FOR THE TOPPING:",
    "In the bowl of a food processor, combine the flour, brown sugar, granulated sugar and salt. Process until well combined, about 30 seconds. Add the cold butter and pulse until the mixture resembles coarse crumbs, with a few pea-sized clumps of butter within. Transfer to a medium bowl and stir in the oats and chopped pecans.",
    "Spoon the topping evenly over the fruit without packing down. Bake for 45-55 minutes, until the fruit is bubbling around the edges and the topping is golden brown. Cool for 20 minutes before serving. Spoon into shallow bowls and serve with vanilla ice cream."
  ],
  "tags": [
    "dessert",
    "soup",
    "rhubarb"
  ],
  "yield": "6-8",
  "image": "/images/recipes/strawberry-rhubarb-crisp.jpg",
  "prepTime": "20 minutes",
  "cookTime": "50 minutes"
}